# -*- coding:utf-8 -*-
# 倒锤头线
#时间问题 停牌问题　停牌因素是否引起计数图形的无效性
import sys
import tick
from pymongo import MongoClient
conn = MongoClient('localhost',27017)
data = []
#锤头线有红绿 input时手动输入%之多少 提示一般为X
#上下影线长度灵活设定  是否上影线越长越好
# 数量多的话可用if分底部或高位
#----------------------------------------------------------
#---------------------此处修改参数---------------------------


db = conn.db.data08
datalist = ['2016-08-15','2016-08-16']


#----------------------------------------------------------
#---------------------此处修改参数---------------------------
ticklen = len(tick.tick)
count = 0
